
#pragma once


//---------------------------------
// 行列からY軸の絶対角取得
// 戻り値 : float
// 引数１ : YsMatrix
//---------------------------------
float GetAngleY(YsMatrix &_Mat);


//---------------------------------
// レイ判定後に当たった位置を取得
// 戻り値 : YsVec3
// 引数１ : レイの開始位置
// 引数２ : レイの終了位置
// 引数３ : 判定で取れた距離
//---------------------------------
YsVec3 GetHitPos(YsVec3 vStart, YsVec3 vEnd, float Dis);


//---------------------------------
// 値を指定した大きさに区切る
// (sizeに1.0fを指定すると0.5(1.0f/2)で切り上げ/切り捨て)
// 引数１ : 区切りたい数 
// 引数２ : 区切る大きさ
//---------------------------------
float PointToCell(float _f, float _size);