//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
// 2D描画シェーダ
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//============================================
// 定数バッファ
//============================================
cbuffer cbPerObject : register(b1)
{
	float4				g_Color;		// 色
};

//============================================
// テクスチャ
//============================================
Texture2D InputTex : register(t0);

SamplerState ClampSmp : register(s1);

//============================================
// 頂点シェーダ出力用構造体
//============================================
struct VS_OUT {
	float4 Pos : SV_Position;
	float2 UV  : TEXCOORD0;
};

//============================================
// 頂点シェーダ
//============================================
VS_OUT VS(float4 pos : POSITION,
			float2 uv : TEXCOORD0
			)
{
	VS_OUT Out = (VS_OUT)0;

	// 頂点座標そのまま出力(頂点は座標は射影座標系で入れておくこと)
	Out.Pos = pos;

	// UV
	Out.UV = uv;

	return Out;
}

//============================================
// ピクセルシェーダ
//============================================
float4 PS(VS_OUT In) : SV_Target0
{
	// テクスチャ色 * 指定色
	return InputTex.Sample(ClampSmp, In.UV) * g_Color;
}
